# ScheduleFieldId Operators

---
The ScheduleFieldId type exposes the following members.
| Name| Description
---|---|---
| Equality(ScheduleFieldId, ScheduleFieldId)| Determines whether two ScheduleFieldIds are the same.
| Inequality(ScheduleFieldId, ScheduleFieldId)| Determines whether two ScheduleFieldId are different.
Top
#### Reference
ScheduleFieldId Class
Autodesk.Revit.DB Namespace